# Wrangling

## Library

In [1]:
library(tidyverse)

-- Attaching packages --------------------------------------- tidyverse 1.2.1 --
v ggplot2 3.1.0     v purrr   0.2.5
v tibble  1.4.2     v dplyr   0.7.8
v tidyr   0.8.2     v stringr 1.3.1
v readr   1.1.1     v forcats 0.3.0
-- Conflicts ------------------------------------------ tidyverse_conflicts() --
x dplyr::filter() masks stats::filter()
x dplyr::lag()    masks stats::lag()

## Sample Data

In [2]:
set.seed(1234)
n = 50
my.df = data.frame(
  com  = paste('C',sample(1:4, n, replace = T),sep=''),
  dept = paste('D',sample(1:3, n, replace = T),sep=''),
  team = paste('T',sample(1:7, n, replace = T),sep=''),
  x1 = rnorm(1:n, mean = 50, sd = 5),
  x2 = rnorm(1:n, mean = 20, sd = 3),
  x3 = rnorm(1:n, mean =  5, sd = 1),
  stringsAsFactors = F
)
head(my.df)

  com dept team x1       x2       x3
1 C1  D1   T1   49.23301 20.24018 4.162418
2 C3  D1   T4   43.04650 18.10577 3.876237
3 C3  D3   T2   46.38209 15.46014 8.043766
4 C3  D2   T2   51.29131 18.09170 5.235021
5 C4  D1   T1   48.41470 20.67890 4.966741
6 C3  D2   T3   49.11105 23.04107 2.267780

## Base R

### Filter

#### Filter Vector
use **logical vector** method

In [3]:
x = c(5,7,8,2,3,6,2,3,5)
x [ x>3 & x<7]

[1] 5 6 5

#### Filter Dataframe
Using **subset( )** method

In [4]:
subset(my.df, com %in% c('C2','C3') & team =="T2")

   com dept team x1       x2       x3
3  C3  D3   T2   46.38209 15.46014 8.043766
4  C3  D2   T2   51.29131 18.09170 5.235021
15 C2  D1   T2   44.02736 18.13139 4.801584
18 C2  D2   T2   58.52982 21.91002 4.210353
27 C3  D2   T2   47.62641 20.29286 5.696769

Using **logical vector** method

In [5]:
selector = with(my.df, com %in% c('C2','C3') & team=='T2')
my.df[selector,]

   com dept team x1       x2       x3
3  C3  D3   T2   46.38209 15.46014 8.043766
4  C3  D2   T2   51.29131 18.09170 5.235021
15 C2  D1   T2   44.02736 18.13139 4.801584
18 C2  D2   T2   58.52982 21.91002 4.210353
27 C3  D2   T2   47.62641 20.29286 5.696769

### Arranging

#### Arrnaging Vector
**Direct Method with Sort( )**

In [6]:
x = c(5,7,8,2,3,6,2,3,5)
sort(x, decreasing = TRUE)

[1] 8 7 6 5 5 3 3 2 2

**Indirect Method with Order**  
**order( )** create a new vector with ordered position.  Use this to rearrange the sequence of data

In [7]:
p = order(x, decreasing = TRUE)
x[p]

[1] 8 7 6 5 5 3 3 2 2

#### Arranging Dataframe 
- **order( )** can be applied over multiple columns  
- Use **with to minimize** typing of dataframe name

In [8]:
my.df[ with(my.df, order(com, dept)),] %>% head(8)

   com dept team x1       x2       x3
1  C1  D1   T1   49.23301 20.24018 4.162418
19 C1  D1   T1   55.00757 19.67470 5.487815
23 C1  D1   T7   54.39102 20.82768 4.034097
25 C1  D1   T4   60.60559 21.04266 2.921762
35 C1  D1   T7   49.73947 18.82962 3.885551
49 C1  D1   T7   53.75251 14.53329 6.173498
7  C1  D2   T2   49.15003 20.75825 4.900209
20 C1  D2   T6   47.52208 21.54129 7.168033

## Dplyr

### Filter

In [9]:
my.df %>% filter (com == 'C2' & dept %in% c('D1','D2'))

   com dept team x1       x2       x3
1  C2  D1   T7   47.98634 14.15526 4.491263
2  C2  D1   T2   44.02736 18.13139 4.801584
3  C2  D1   T7   51.27598 24.18544 2.144241
4  C2  D2   T2   58.52982 21.91002 4.210353
5  C2  D1   T6   51.77775 21.19782 5.500695
6  C2  D2   T5   45.51868 19.29614 6.842464
7  C2  D1   T1   50.84093 16.83985 6.112363
8  C2  D1   T5   44.45116 18.75674 6.493493
9  C2  D1   T3   50.84513 19.79392 4.393849
10 C2  D1   T3   49.86862 24.41302 5.629536
11 C2  D1   T4   60.29081 19.00203 7.273484

### Select

#### Columns by Name Range

In [10]:
my.df %>% select( com, team:x2) %>% head

  com team x1       x2
1 C1  T1   49.23301 20.24018
2 C3  T4   43.04650 18.10577
3 C3  T2   46.38209 15.46014
4 C3  T2   51.29131 18.09170
5 C4  T1   48.41470 20.67890
6 C3  T3   49.11105 23.04107

#### Columns by Number Range

In [11]:
my.df %>% select( 1,3:5) %>% head

  com team x1       x2
1 C1  T1   49.23301 20.24018
2 C3  T4   43.04650 18.10577
3 C3  T2   46.38209 15.46014
4 C3  T2   51.29131 18.09170
5 C4  T1   48.41470 20.67890
6 C3  T3   49.11105 23.04107

#### Columns by Name Matching
Use **contain**

In [12]:
my.df %>% select(contains("x")) %>% head

  x1       x2       x3
1 49.23301 20.24018 4.162418
2 43.04650 18.10577 3.876237
3 46.38209 15.46014 8.043766
4 51.29131 18.09170 5.235021
5 48.41470 20.67890 4.966741
6 49.11105 23.04107 2.267780

Use **start_with**

In [13]:
my.df %>% select(starts_with('x')) %>% head

  x1       x2       x3
1 49.23301 20.24018 4.162418
2 43.04650 18.10577 3.876237
3 46.38209 15.46014 8.043766
4 51.29131 18.09170 5.235021
5 48.41470 20.67890 4.966741
6 49.11105 23.04107 2.267780

Use **end_with**

In [14]:
my.df %>% select(ends_with('1')) %>% head

  x1
1 49.23301
2 43.04650
3 46.38209
4 51.29131
5 48.41470
6 49.11105

#### Columns by Data Type

In [15]:
my.df %>% select_if(is.numeric) %>% head

  x1       x2       x3
1 49.23301 20.24018 4.162418
2 43.04650 18.10577 3.876237
3 46.38209 15.46014 8.043766
4 51.29131 18.09170 5.235021
5 48.41470 20.67890 4.966741
6 49.11105 23.04107 2.267780

### Arrange
**Sort entire data frame**

In [16]:
my.df %>% arrange(com,team) %>% head

  com dept team x1       x2       x3
1 C1  D1   T1   49.23301 20.24018 4.162418
2 C1  D3   T1   43.13849 16.48416 5.976032
3 C1  D1   T1   55.00757 19.67470 5.487815
4 C1  D2   T2   49.15003 20.75825 4.900209
5 C1  D3   T3   45.87001 20.36528 5.311681
6 C1  D1   T4   60.60559 21.04266 2.921762

### Joins
Join will automatically pick the common column names from both sides to join by

#### Sample Data

In [17]:
superheroes <- "
    name, alignment, gender,         publisher
 Magneto,       bad,   male,            Marvel
   Storm,      good, female,            Marvel
Mystique,       bad, female,            Marvel
  Batman,      good,   male,                DC
   Joker,       bad,   male,                DC
Catwoman,       bad, female,                DC
 Hellboy,      good,   male, Dark Horse Comics
"
superheroes <- read_csv(superheroes, skip = 1)

publishers <- "
  publisher, yr_founded
         DC,       1934
     Marvel,       1939
      Image,       1992
"
publishers <- read_csv(publishers, skip = 1)

In [18]:
superheroes

  name     alignment gender publisher
1 Magneto  bad       male   Marvel
2 Storm    good      female Marvel
3 Mystique bad       female Marvel
4 Batman   good      male   DC
5 Joker    bad       male   DC
6 Catwoman bad       female DC
7 Hellboy  good      male   Dark Horse Comics

In [19]:
publishers

  publisher yr_founded
1 DC        1934
2 Marvel    1939
3 Image     1992

#### left_join
- Everthing from the left side, matching from right.  
- If no matching from right, result in NA

In [20]:
left_join(superheroes,publishers)

Joining, by = "publisher"

  name     alignment gender publisher         yr_founded
1 Magneto  bad       male   Marvel            1939
2 Storm    good      female Marvel            1939
3 Mystique bad       female Marvel            1939
4 Batman   good      male   DC                1934
5 Joker    bad       male   DC                1934
6 Catwoman bad       female DC                1934
7 Hellboy  good      male   Dark Horse Comics   NA

#### right_join
- Everything from **right**, matching from **left**
- If no matching from left, NA is produced

In [21]:
right_join(superheroes, publishers)

Joining, by = "publisher"

  name     alignment gender publisher yr_founded
1 Batman   good      male   DC        1934
2 Joker    bad       male   DC        1934
3 Catwoman bad       female DC        1934
4 Magneto  bad       male   Marvel    1939
5 Storm    good      female Marvel    1939
6 Mystique bad       female Marvel    1939
7 NA       NA        NA     Image     1992

#### inner_join
Only return **matching from both** left and right

In [22]:
inner_join(superheroes, publishers)

Joining, by = "publisher"

  name     alignment gender publisher yr_founded
1 Magneto  bad       male   Marvel    1939
2 Storm    good      female Marvel    1939
3 Mystique bad       female Marvel    1939
4 Batman   good      male   DC        1934
5 Joker    bad       male   DC        1934
6 Catwoman bad       female DC        1934

#### semi_join
- Similar to inner_join, but **only left columns are kept**

In [23]:
semi_join( superheroes, publishers)

Joining, by = "publisher"

  name     alignment gender publisher
1 Magneto  bad       male   Marvel
2 Storm    good      female Marvel
3 Mystique bad       female Marvel
4 Batman   good      male   DC
5 Joker    bad       male   DC
6 Catwoman bad       female DC

#### anti_join
- Return all rows from left where there is **no matching** from right
- Keep only **left columns**
- This is **filtering join**

In [24]:
anti_join( superheroes, publishers)

Joining, by = "publisher"

  name    alignment gender publisher
1 Hellboy good      male   Dark Horse Comics

#### full_join
Join everything from left and right, produce NA if there is non matching at left or right

In [25]:
full_join(superheroes, publishers)

Joining, by = "publisher"

  name     alignment gender publisher         yr_founded
1 Magneto  bad       male   Marvel            1939
2 Storm    good      female Marvel            1939
3 Mystique bad       female Marvel            1939
4 Batman   good      male   DC                1934
5 Joker    bad       male   DC                1934
6 Catwoman bad       female DC                1934
7 Hellboy  good      male   Dark Horse Comics   NA
8 NA       NA        NA     Image             1992

### Count
Count product **frequency table** for underlying groups.  
Observe that the result has **no group**

In [26]:
csummary = count(my.df, com, dept)
print( csummary )

# A tibble: 12 x 3
   com   dept      n
   <chr> <chr> <int>
 1 C1    D1        6
 2 C1    D2        3
 3 C1    D3        3
 4 C2    D1        9
 5 C2    D2        2
 6 C2    D3        2
 7 C3    D1        6
 8 C3    D2        5
 9 C3    D3        4
10 C4    D1        5
11 C4    D2        1
12 C4    D3        4

Notice that cound is essentially a **shortcut for group_by and summarize**.  
- See below reproduce the result as count. 
- However, unlike **count**, this method reduce by 1 instead of completely ungroup the entire tibble

In [27]:
csummary = group_by(my.df, com, dept) %>% summarise(n=n())
print( csummary )

# A tibble: 12 x 3
# Groups:   com [?]
   com   dept      n
   <chr> <chr> <int>
 1 C1    D1        6
 2 C1    D2        3
 3 C1    D3        3
 4 C2    D1        9
 5 C2    D2        2
 6 C2    D3        2
 7 C3    D1        6
 8 C3    D2        5
 9 C3    D3        4
10 C4    D1        5
11 C4    D2        1
12 C4    D3        4

### Summarize
#### summarize
**Summarize over entire tibble**

In [28]:
my.df %>% 
summarize (x1_mean = mean(x1),
           x2_sum = sum(x2))

  x1_mean x2_sum
1 50.3094 1006.33

**Summarize per Group**  
Notice that summarize **reduce group** level by 1

In [29]:
gsummary = 
  my.df %>% 
    group_by(com,dept) %>% 
    summarize (x1_mean = mean(x1),
               x2_sum  = sum(x2))

print( gsummary )

# A tibble: 12 x 4
# Groups:   com [?]
   com   dept  x1_mean x2_sum
   <chr> <chr>   <dbl>  <dbl>
 1 C1    D1       53.8  115.
 2 C1    D2       47.8   61.5
 3 C1    D3       48.0   58.4
 4 C2    D1       50.2  176.
 5 C2    D2       52.0   41.2
 6 C2    D3       47.6   49.1
 7 C3    D1       49.8  120.
 8 C3    D2       49.8  104.
 9 C3    D3       49.5   74.4
10 C4    D1       49.9  105.
11 C4    D2       52.1   18.9
12 C4    D3       52.0   81.9

#### Multiple Columns (Conditional)

In [30]:
gsummary = 
  my.df %>% 
    group_by(com,dept) %>% 
    summarize_if (is.numeric, mean)

print( gsummary )

# A tibble: 12 x 5
# Groups:   com [?]
   com   dept     x1    x2    x3
   <chr> <chr> <dbl> <dbl> <dbl>
 1 C1    D1     53.8  19.2  4.44
 2 C1    D2     47.8  20.5  5.56
 3 C1    D3     48.0  19.5  5.48
 4 C2    D1     50.2  19.6  5.20
 5 C2    D2     52.0  20.6  5.53
 6 C2    D3     47.6  24.5  5.69
 7 C3    D1     49.8  20.0  5.21
 8 C3    D2     49.8  20.8  4.83
 9 C3    D3     49.5  18.6  6.45
10 C4    D1     49.9  21.0  4.99
11 C4    D2     52.1  18.9  5.49
12 C4    D3     52.0  20.5  4.94

#### Multiple Columns (Names and Position)
**Specific column names**

In [31]:
my.df %>% 
    group_by(com,dept) %>% 
    summarize_at (c('x1','x2','x3'), mean) %>% head

  com dept x1       x2       x3
1 C1  D1   53.78819 19.19136 4.444190
2 C1  D2   47.80892 20.50587 5.556002
3 C1  D3   47.95769 19.45608 5.483456
4 C2  D1   50.15156 19.60838 5.204501
5 C2  D2   52.02425 20.60308 5.526408
6 C2  D3   47.58095 24.53748 5.690336

**Specific Column Names Pattern Matching**

In [32]:
my.df %>% 
    group_by(com,dept) %>% 
    summarize_at(vars(matches('x')), mean) %>% head

  com dept x1       x2       x3
1 C1  D1   53.78819 19.19136 4.444190
2 C1  D2   47.80892 20.50587 5.556002
3 C1  D3   47.95769 19.45608 5.483456
4 C2  D1   50.15156 19.60838 5.204501
5 C2  D2   52.02425 20.60308 5.526408
6 C2  D3   47.58095 24.53748 5.690336

**Column Names and Number Range**

In [33]:
my.df %>% 
    group_by(com,dept) %>% 
    summarize_at(vars(x1:x3), mean) %>% head

  com dept x1       x2       x3
1 C1  D1   53.78819 19.19136 4.444190
2 C1  D2   47.80892 20.50587 5.556002
3 C1  D3   47.95769 19.45608 5.483456
4 C2  D1   50.15156 19.60838 5.204501
5 C2  D2   52.02425 20.60308 5.526408
6 C2  D3   47.58095 24.53748 5.690336

In [34]:
my.df %>% 
    group_by(com,dept) %>% 
    summarize_at(vars(4:6), mean) %>% head

  com dept x1       x2       x3
1 C1  D1   53.78819 19.19136 4.444190
2 C1  D2   47.80892 20.50587 5.556002
3 C1  D3   47.95769 19.45608 5.483456
4 C2  D1   50.15156 19.60838 5.204501
5 C2  D2   52.02425 20.60308 5.526408
6 C2  D3   47.58095 24.53748 5.690336